# Rekenfuncties

In [1]:
%LOAD ../data/employees.db

Met `ROUND`, `CEILING` en `FLOOR` kun je getallen manipuleren.

Een uitgebreid overzicht van rekenfuncties is te vinden bij de SQL cursus van W3 Schools bij SQL Server Numeric Functions

https://www.w3schools.com/sql/sql_ref_mysql.asp

## Dual

`DUAL` is een centrale dummy tabel met één rij waar je gebruik van kunt maken om functies te testen.

Reken bijvoorbeeld uit hoeveel 3 x 4 is.

```SQL
SELECT 3 * 4 uitkomst
FROM dual;
```

Zonder de FROM dual werkt het ook.

In [3]:
SELECT 3 * 4 uitkomst;

+----------+
| uitkomst |
+----------+
| 12       |
+----------+

## Round

Met ROUND kun je getallen afronden op een bepaald aantal decimalen. Als het aantal decimalen niet wordt opgegeven, wordt er afgerond op 0 decimalen.

In [4]:
SELECT ROUND(45.926);

+---------------+
| ROUND(45.926) |
+---------------+
| 46.0          |
+---------------+

In [5]:
SELECT ROUND(45.926, 2);

+------------------+
| ROUND(45.926, 2) |
+------------------+
| 45.93            |
+------------------+

ROUND kun je ook gebruiken voor het afronden van datums. Je krijgt dan YYYYMMDD terug.

In [6]:
SELECT last_name, ROUND(hire_date)
FROM employees;

+-----------+------------------+
| last_name | ROUND(hire_date) |
+-----------+------------------+
| King      | 1987.0           |
+-----------+------------------+
| Kochhar   | 1989.0           |
+-----------+------------------+
| De Haan   | 1993.0           |
+-----------+------------------+
| Hunold    | 1990.0           |
+-----------+------------------+
| Ernst     | 1991.0           |
+-----------+------------------+
| Lorentz   | 1999.0           |
+-----------+------------------+
| Mourgos   | 1999.0           |
+-----------+------------------+
| Rajs      | 1995.0           |
+-----------+------------------+
| Davies    | 1997.0           |
+-----------+------------------+
| Matos     | 1998.0           |
+-----------+------------------+
| Vargas    | 1998.0           |
+-----------+------------------+
| Zlotkey   | 2000.0           |
+-----------+------------------+
| Abel      | 1996.0           |
+-----------+------------------+
| Taylor    | 1998.0           |
+-----------+------------------+
| Grant     | 1999.0           |
+-----------+------------------+
| Whalen    | 1987.0           |
+-----------+------------------+
| Hartstein | 1996.0           |
+-----------+------------------+
| Fay       | 1997.0           |
+-----------+------------------+
| Higgins   | 1994.0           |
+-----------+------------------+
| Gietz     | 1994.0           |
+-----------+------------------+

## Ceiling

Met `CEILING` kun je afronden naar boven op een heel getal.

In [9]:
SELECT CEILING(45.236);

+-----------------+
| CEILING(45.236) |
+-----------------+
| 46.0            |
+-----------------+

## Floor

Met `FLOOR` rond je af naar beneden op een heel getal.

In [10]:
SELECT FLOOR(45.926);

+---------------+
| FLOOR(45.926) |
+---------------+
| 45.0          |
+---------------+